/*********************************************************
* 名    称：EnumResultCode.cs
* 作    者：刘孟
* 联系方式：电话[13629774594],邮件[1450873843@qq.com]
* 创建时间：20220303
* 描    述：用户登录结果
* 更新历史：
*
* *******************************************************/

namespace SmartLibrary.User.Application.GrpcService.Enum
{
    public enum EnumResultCode
    {
        成功 = 200,
        账号密码必填 = 500,
        手机号码必填 = 501,
        身份证号密码必填 = 502,
        卡号必填 = 502,
        用户名称必填 = 503,
        账号密码不匹配 = 510,
        未找到卡信息 = 515,
        临时馆员卡过期 = 520,
        未找到读者信息 = 530,
        用户状态异常 = 540,
        手机号格式错误 = 550,
        手机号已存在 = 560,
        邮箱格式错误 = 570,
        邮箱已存在 = 580,
        身份证格式错误 = 590,
        身份证号已存在 = 600,
        密码较弱 = 700,
        未知异常 = 999

    }
}
